Revit 2027 API
ImageTypeOptions.SetPath(String) Method
Update the path of the file that specifies the image to be used.
The provided string path must specify a local file. The path can be absolute or relative to the project's location. ImageType will respectively use an absolute or relative path.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetPath(
	string path
)
Public Sub SetPath (
	path As String
)
public:
void SetPath(
	String^ path
)
member SetPath :
        path : string -> unit
Parameters
path String
 The file path that specifies the image to be used.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ImageTypeOptions Class
SetPath Overload
Autodesk.Revit.DB Namespace